yiming543/GF_48S/ESS-GF-BCU/ESS-GF_BCU-F767ZI/src/STM32_SelfTest_Library/src/stm32fxx_STLstartup.c
#endif //(SEGGER_RTT_Viewer)
	   
      #endif  /* STL_VERBOSE_POR */
 //FailSafePOR();

    
#ifndef BCU_Self_Test_DeBugMode
		 FailSafePOR();			  
#endif // !BCU_Self_Test_DeBugMode

	    
	    CONTROL_FLOW_RESUME(CRC_TEST_CALLER);  //willy aviod CRC should be delected
    }
    else
    { /* Test OK */
      #ifdef STL_VERBOSE_POR
        printf(" Start-up FLASH 32-bit CRC OK\n\r");
	    SEGGER_RTT_WriteString(0, " Start-up FLASH 32-bit CRC OK\n\r");  
      #endif  /* STL_VERBOSE_POR */

      /* If else statement is not executed, it will be detected by control flow monitoring */
      CONTROL_FLOW_RESUME(CRC_TEST_CALLER);  
    }
	
  HAL_CRC_DeInit(&CrcHandle);
  #ifdef STL_EVAL_MODE
    /* LED_NVM Off for debug purposes */
    BSP_LED_Off(LED_NVM);
  #endif /* STL_EVAL_MODE */
	
  /*--------------------------------------------------------------------------*/
  /*   Verify Control flow before RAM init (which clears Ctrl flow counters)  */
  /*--------------------------------------------------------------------------*/
  if (control_flow_check_point(CHECKPOINT1) == ERROR)
  {
    printf(" Control Flow Error Checkpoint 1\n\r");
    SEGGER_RTT_WriteString(0, " Control Flow Error Checkpoint 1\n\r");
    FailSafePOR();
  }
  else
  {	
	SEGGER_RTT_WriteString(0, " Control Flow Checkpoint 1 OK \n\r");
	printf(" Control Flow Checkpoint 1 OK \n\r");	 
  }
	
  /*--------------------------------------------------------------------------*/
  /* --------------------- Variable memory functional test -------------------*/
  /*--------------------------------------------------------------------------*/
  #ifdef STL_EVAL_MODE
    /* LED_VLM On for debug purposes */
    BSP_LED_On(LED_VLM);
  #endif /* STL_EVAL_MODE */
  
  /* no stack operation can be performed during the test */  
	__disable_irq();

  /* WARNING: Stack is zero-initialized when exiting from this routine */
//  if (STL_FullRamMarchC(RAM_START, RAM_END, BCKGRND) != SUCCESS)

    if (STL_FullRamMarchC(RAM_START, RAM_END, BCKGRND, RAM_BCKUP) != SUCCESS)
    {
    #ifdef STL_VERBOSE_POR
      /* restore interrupt capability */
      __enable_irq();
      /* restore destroyed content of HAL structure for UART */
      UartHandle.Instance = USART3;
      UartHandle.ErrorCode = HAL_UART_ERROR_NONE;
      __HAL_UART_RESET_HANDLE_STATE(&UartHandle);

      #ifdef __GNUC__
      /* restore the data segment initializers from flash to SRAM (repeat  procedure from startup) */
        extern void Startup_Copy_Handler (void);
        Startup_Copy_Handler();

        printf(" RAM Test Failure \n\r");
	   SEGGER_RTT_WriteString(0, " RAM Test Failure \n\r");
#if defined (SEGGER_RTT_Viewer)
	 
#endif //(SEGGER_RTT_Viewer)
	
      #endif /* GCC Compiler */
      #ifdef __IAR_SYSTEMS_ICC__
        __iar_data_init3();
        printf("RAM Test Failure\n\r");
      #endif /* __IAR_SYSTEMS_ICC__ */
    #endif  /* STL_VERBOSE_POR */
    FailSafePOR();
  }
  #ifdef STL_VERBOSE_POR
    /* restore interrupt capability */

    __enable_irq();
	
	/* restore destroyed content of HAL structure for UART */
	UartHandle.Instance = USART3;
	UartHandle.ErrorCode = HAL_UART_ERROR_NONE;
	__HAL_UART_RESET_HANDLE_STATE(&UartHandle);	

    /* restore the data segment initializers from flash to SRAM (repeat procedure from IAR & GCC startup) */
    #ifdef __GNUC__
    extern void Startup_Copy_Handler (void);
    Startup_Copy_Handler();

	SEGGER_RTT_WriteString(0, " Full RAM Test OK\n\r");
	printf(" Full RAM Test OK\n\r");

    #endif /* GCC Compiler */
    #ifdef __IAR_SYSTEMS_ICC__
      __iar_data_init3();
      printf(" Full RAM Test OK\n\r");
    #endif /* __IAR_SYSTEMS_ICC__ */
  #endif /* STL_VERBOSE_POR */

  /* restore interrupt capability */
  __enable_irq();
 
  /* Initialization of counters for control flow monitoring 
     (destroyed during RAM test) */
  INIT_CONTROL_FLOW();

  #ifdef STL_EVAL_MODE
    /* restore destroyed C compiler constant areas */
    #ifdef __IAR_SYSTEMS_ICC__  /* IAR Compiler */
      __iar_data_init3();

      /* LED_VLM Off for debug purposes - can be applied after C-data refresh at SRAM exclusively */
      BSP_LED_Off(LED_VLM);
    #endif /* __IAR_SYSTEMS_ICC__ */
    #ifdef __GNUC__  /* GCC Compiler */
      Startup_Copy_Handler();
      /* LED_VLM Off for debug purposes - can be applied after C-data refresh at SRAM exclusively */
      BSP_LED_Off(LED_VLM);
	 
    #endif /* __GNUC__ */
  #endif /* STL_EVAL_MODE */


  /*--------------------------------------------------------------------------*/
  /*------------- Store reference 32-bit CRC in RAM after RAM test -----------*/
  /*--------------------------------------------------------------------------*/
  CONTROL_FLOW_CALL(CRC_STORE_CALLER);
  
  /* restore destroyed content of HAL structure for CRC */
  CrcHandle.Instance = CRC;
  CrcHandle.State= HAL_CRC_STATE_READY;
  #ifdef  CRC_UNIT_CONFIGURABLE
    CrcHandle.Init.DefaultPolynomialUse    = DEFAULT_POLYNOMIAL_ENABLE;
    CrcHandle.Init.DefaultInitValueUse     = DEFAULT_INIT_VALUE_ENABLE;
    CrcHandle.Init.InputDataInversionMode  = CRC_INPUTDATA_INVERSION_NONE;
    CrcHandle.Init.OutputDataInversionMode = CRC_OUTPUTDATA_INVERSION_DISABLED;
    CrcHandle.InputDataFormat = CRC_INPUTDATA_FORMAT_WORDS;
  #endif
  
  /* read and store content of CRC calculation result */
  RefCrc32 = HAL_CRC_Accumulate(&CrcHandle, 0u, 0u);  
  RefCrc32Inv = ~RefCrc32;
  
  CONTROL_FLOW_RESUME(CRC_STORE_CALLER);  

  /*--------------------------------------------------------------------------*/
  /*----------------------- Clock Frequency Self Test ------------------------*/
  /*--------------------------------------------------------------------------*/
  #ifdef STL_EVAL_MODE
    #ifdef __IAR_SYSTEMS_ICC__  /* IAR Compiler */
      /* LED_NVM On for debug purposes - can be applied after C-data refresh at SRAM exclusively */
      BSP_LED_On(LED_NVM);
    #endif /* __IAR_SYSTEMS_ICC__ */
    #ifdef __GNUC__  /* GCC Compiler */
      /* LED_VLM On for debug purposes - can be applied after C-data refresh at SRAM exclusively */
      BSP_LED_On(LED_NVM);
    #endif /* __GNUC__ */
  #endif /* STL_EVAL_MODE */
    
  #ifdef STL_VERBOSE_POR
    /* finish communication flow prior system clock change */
    while (HAL_UART_GetState(&UartHandle) == HAL_UART_STATE_BUSY_TX)
    { }
	
