yiming543/GF_48S/ESS-GF-BCU/ESS-GF_BCU-F767ZI/src/STM32_SelfTest_Library/src/stm32fxx_STLstartup.c
	/* Re-init communication channel with modified clock setting */
	UartHandle.Instance        = USART3;
	HAL_UART_DeInit(&UartHandle);
    
	UartHandle.Init.BaudRate   = 9600;
	UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
	UartHandle.Init.StopBits   = UART_STOPBITS_1;
	UartHandle.Init.Parity     = UART_PARITY_NONE;
	UartHandle.Init.HwFlowCtl  = UART_HWCONTROL_NONE;
	UartHandle.Init.Mode       = UART_MODE_TX;
	HAL_UART_Init(&UartHandle);
	
  #endif /* STL_VERBOSE_POR */
//	printf(" Full RAM Test 11221\n\r");	
  CONTROL_FLOW_CALL(CLOCK_TEST_CALLER);

  /* test LSI & HSE clock systems */
  clk_sts = STL_ClockStartUpTest();
//	printf(" Full RAM Test 22332\n\r");	
  #ifdef STL_VERBOSE_POR
    /* Re-init communication channel with modified clock setting */
    UartHandle.Instance        = USART3;
    HAL_UART_DeInit(&UartHandle);
    
	UartHandle.Init.BaudRate   = 9600;
    UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
    UartHandle.Init.StopBits   = UART_STOPBITS_1;
    UartHandle.Init.Parity     = UART_PARITY_NONE;
    UartHandle.Init.HwFlowCtl  = UART_HWCONTROL_NONE;
    UartHandle.Init.Mode       = UART_MODE_TX;
    HAL_UART_Init(&UartHandle);
#if defined (SEGGER_RTT_Viewer)
		SEGGER_RTT_Init();
	SEGGER_RTT_SetTerminal(1);      // Select terminal 1
	SEGGER_RTT_ConfigUpBuffer(0, NULL, NULL, 0, SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL);
#endif //(SEGGER_RTT_Viewer)

    /* print out the test result */
    switch (clk_sts)
    {
      case LSI_START_FAIL:
        printf(" LSI start-up failure \n\r");
	    SEGGER_RTT_WriteString(0, " LSI start-up failure \n\r");
        break;
  
      case HSE_START_FAIL:
        printf(" HSE start-up failure \n\r");
	    SEGGER_RTT_WriteString(0, " HSE start-up failure \n\r");
        break;
  
      case HSI_HSE_SWITCH_FAIL:
      case HSE_HSI_SWITCH_FAIL:
      case PLL_OFF_FAIL:
        printf(" Clock switch failure \n\r");
	    SEGGER_RTT_WriteString(0, " Clock switch failure \n\r");
        break;
  
      case XCROSS_CONFIG_FAIL:
        printf(" Clock Xcross measurement failure \n\r");
	    SEGGER_RTT_WriteString(0, " Clock Xcross measurement failure \n\r");
        break;
  
      case EXT_SOURCE_FAIL:
        printf(" HSE clock found out of range\n\r");
	    SEGGER_RTT_WriteString(0, " HSE clock found out of range\n\r");
        break;
        
      case FREQ_OK:
        printf(" Clock frequency OK \n\r");
	    SEGGER_RTT_WriteString(0, " Clock frequency OK \n\r");
        break;
        
      default:
        printf(" Abnormal exit from clock test\n\r");
	    SEGGER_RTT_WriteString(0, " Abnormal exit from clock test\n\r");
	    break;
    }
  #endif /* STL_VERBOSE_POR */
  
  if (clk_sts != FREQ_OK)
  {
      FailSafePOR();
  }
    
  CONTROL_FLOW_RESUME(CLOCK_TEST_CALLER);  
  
  #ifdef STL_EVAL_MODE
    #ifdef __IAR_SYSTEMS_ICC__  /* IAR Compiler */
      /* LED_NVM Off for debug purposes - can be applied after C-data refresh at SRAM exclusively */
      BSP_LED_Off(LED_NVM);
    #endif /* __IAR_SYSTEMS_ICC__ */
    #ifdef __GNUC__  /* GCC Compiler */
      /* LED_NVM Off for debug purposes - can be applied after C-data refresh at SRAM exclusively */
      BSP_LED_Off(LED_NVM);
    #endif /* __GNUC__ */
  #endif /* STL_EVAL_MODE */

  /*--------------------------------------------------------------------------*/
  /* --------------- Initialize stack overflow pattern ---------------------- */
  /*--------------------------------------------------------------------------*/

  CONTROL_FLOW_CALL(STACK_OVERFLOW_TEST);
  
  aStackOverFlowPtrn[0] = 0xEEEEEEEEuL;
  aStackOverFlowPtrn[1] = 0xCCCCCCCCuL;
  aStackOverFlowPtrn[2] = 0xBBBBBBBBuL;
  aStackOverFlowPtrn[3] = 0xDDDDDDDDuL;
  
  CONTROL_FLOW_RESUME(STACK_OVERFLOW_TEST);  

  /*--------------------------------------------------------------------------*/
  /* -----  Verify Control flow before Starting main program execution ------ */
  /*--------------------------------------------------------------------------*/
   
  if (control_flow_check_point(CHECKPOINT2) == ERROR)
  {
     #ifdef STL_VERBOSE_POR
       printf(" Control Flow Error Checkpoint 2\n\r");
	  SEGGER_RTT_WriteString(0, " Control Flow Error Checkpoint 2\n\r");
     #endif  /* STL_VERBOSE_POR */
     FailSafePOR();
   }
   #ifdef STL_VERBOSE_POR
    printf(" Control Flow Checkpoint 2 OK \n\r");
	SEGGER_RTT_WriteString(0, " Control Flow Checkpoint 2 OK \n\r");
  
    /* finish communication flow prior system clock change */
    while (HAL_UART_GetState(&UartHandle) == HAL_UART_STATE_BUSY_TX)
    { }
   #endif  /* STL_VERBOSE_POR */
	extern void _start(); 
   /* startup test completed successfully - restart the application */
   GOTO_COMPILER_STARTUP();
}

/******************************************************************************/
/**
  * @brief  Verifies the watchdog by forcing watchdog resets
  * @param  : None
  * @retval : None
  */
void STL_WDGSelfTest(void)
{
  /* ==============================================================================*/
  /* MISRA violation of rule 12.4 - side effect of && and || operators ignored */
  #ifdef __IAR_SYSTEMS_ICC__  /* IAR Compiler */
    #pragma diag_suppress=Pm026
  #endif /* __IAR_SYSTEMS_ICC__ */

  #ifdef STL_VERBOSE_POR  
	if (__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST)  != RESET) 
	{
		printf(" Pin reset \r\n");
		SEGGER_RTT_WriteString(0, " Pin reset \r\n");
	}
	if (__HAL_RCC_GET_FLAG(RCC_FLAG_PORRST)  != RESET) 
	{
		printf(" POR reset \r\n");
		SEGGER_RTT_WriteString(0, " POR reset \r\n");
	}
	if (__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST)  != RESET) 
	{
		printf(" SW reset \r\n");
		SEGGER_RTT_WriteString(0, " SW reset \r\n");
	}
	if (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST) != RESET) 
	{
		printf(" IWDG reset \r\n");
		SEGGER_RTT_WriteString(0, " IWDG reset \r\n");
	}
	if (__HAL_RCC_GET_FLAG(RCC_FLAG_WWDGRST) != RESET) 
	{
		printf(" WWDG reset \r\n");
		SEGGER_RTT_WriteString(0, " WWDG reset \r\n");
	}
	if (__HAL_RCC_GET_FLAG(RCC_FLAG_LPWRRST) != RESET) 
	{
		printf(" LP reset \r\n");
		SEGGER_RTT_WriteString(0, " LP reset \r\n");
	}
  #endif /* STL_VERBOSE_POR */

  /* start watchdogs test if one of the 4 conditions below is valid */
  if ( (__HAL_RCC_GET_FLAG(RCC_FLAG_PORRST) != RESET)\
   ||  (__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST) != RESET)\
   ||  (__HAL_RCC_GET_FLAG(RCC_FLAG_LPWRRST) != RESET)\
   || ((__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST) != RESET)
	&& (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST) == RESET)
	&& (__HAL_RCC_GET_FLAG(RCC_FLAG_WWDGRST) == RESET)))
  {
    #ifdef STL_VERBOSE_POR
      printf(" Power-on or software reset, testing IWDG \r\n");
	  SEGGER_RTT_WriteString(0, " Power-on or software reset, testing IWDG \r\n");
    #endif  /* STL_VERBOSE_POR */

    #if defined(STL_EVAL_MODE)
      /* IWDG at debug mode */
      __DBGMCU_CLK_ENABLE();
      __HAL_FREEZE_IWDG_DBGMCU();
    #endif  /* STL_EVAL_MODE */

